# StairstypeShowUpdown Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeShowUpdown Property
ParameterTypeId Class See Also
---
"Show Up/Down in Plan": Show Up/Down in Plan
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeShowUpdown { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeShowUpdown As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeShowUpdown {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace